:PROPERTIES:
:ID:       2be4cc16-07cd-4dd7-a05d-a39d666937dc
:END:
#+TITLE: Huggingface Model Cards
#+CATEGORY: slips
#+TAGS:  
* Roam
+ [[id:dd44e493-65ce-4ccb-b770-4a5d0308aad2][Datasets]]
+ [[id:fbf026c8-6c89-4ad3-a72e-2d693371c76a][Machine Learning]]
+ [[id:cea7d11c-8357-4e4f-90b3-fa8210eff796][AI]]

* Docs

* Resources

+ [[https://zenodo.org/records/17341083][Huggingface Model Cards Metadata Dataset]]

* Notes

* Model Cards Metadata Dataset
:PROPERTIES:
:header-args+: :var obtmp=(or (bound-and-true-p ob@huggingface_model_cards) (setq ob@huggingface_model_cards (make-temp-file "roam-" t)))
:END:

| huggingface_link | The feature provides the direct link to the landing page of the model card.                                                                                    |
| modelId          | These two features provide a unique identifier for each model and may indicate the model hierarchy and serve as a primary key for reference.                   |
| pipeline_tag     | It represents the primary task associated with the model.                                                                                                      |
| downloads        | It represents the number of times a model has been downloaded, previously it indicated cumulative downloads, but currently it reflects last month's downloads. |
| likes            | The number of likes a model has received on the Hugging Face.                                                                                                  |
| library_name     | It specifies the library or framework used by the model.                                                                                                       |
| private          | It indicates about the status of the repositories and generally False.                                                                                         |
| createdAt:       | It shows the timeline but normally showcase date of extraction.                                                                                                |
| tags_cleaned     | This is the key processed feature for model cards, it carries features associated with the model such as language                                              |
| lics             | It indicates the license coverage of each model card as specified by the developers/maintainers                                                                |
| arxiv_ids        | This feature provides the respective arXiv ID(s) for each model card, offering a potential link to the corresponding publication(s).                           |
| base_model       | This feature provides the respective base model for each model card, offering information about base model(s).                                                 |
| dataset          | It indicates the dataset coverage of each model card as specified by the developers/maintainers                                                                |

Examples:

| huggingface_link                             | modelId           | pipeline_tag        | downloads | likes | library_name | private | createdAt                | tags_cleaned | lics               | arxiv_ids        | base_model                                              | dataset                       |
|----------------------------------------------+-------------------+---------------------+-----------+-------+--------------+---------+--------------------------+--------------+--------------------+------------------+---------------------------------------------------------+-------------------------------|
| https://huggingface.co/albert/albert-base-v1 | bert-base-uncased | text-classification | 100,000   |   123 | transformers | False   | 2025-03-02T23:29:04.000Z | safetensors  | license:apache-2.0 | arxiv:2305.13035 | base_model:deepseek-ai/DeepSeek-V3.2-Exp-Base           | dataset:ds4sd/SynthCodeNet    |
| https://huggingface.co/albert/albert-base-v2 | gpt-neo-2.7B      | question-answering  |           |       | diffusers    |         |                          | en, fr, de   | license:mit        | arxiv:2303.15343 | base_model:quantized:deepseek-ai/DeepSeek-V3.2-Exp-Base | dataset:ds4sd/SynthFormulaNet |

** Babel
:PROPERTIES:
:header-args: :dir (identity ob@huggingface_model_cards)
:END:

*** Download

With curl (doesn't work)

#+begin_src sh
echo $(pwd)
urlroot="https://zenodo.org/records/17341083/files"
# models_with_basemodel="Sep_2025_models_with_license_and_basemodel.csv"
# models_with_dataset="Sep_2025_models_with_license_and_dataset.csv"

for f in Sep_2025_models_with_license_and_{dataset,basemodel}.csv; do
    url="$urlroot/$f"
    curl -q "$url/$f.csv?download=1" > $f
done
#+end_src

#+RESULTS:
: /tmp/roam-TEKlTq

restclient is also failing for some reason
#+name: modelcardsDownload
#+header-args+ :var dataset="basemodel"
#+begin_src restclient :results output file :file "models_with_basemodefdsa.csv"
:url-base = https://zenodo.org/records/17341083/files
:url = Sep_2025_models_with_license_and_:dataset.csv

# models_with_basemodel="Sep_2025_models_with_license_and_basemodel.csv"
# models_with_dataset="Sep_2025_models_with_license_and_dataset.csv"

# Accept: application/csv
User-Agent: Mozilla/5.0 (X11; Linux x86_64; rv:138.0) Gecko/20100101 Firefox/138.0

GET :url-base/:url?download=1
#+end_src

#+RESULTS:
[[file:../../../../../tmp/roam-TEKlTq/models_with_basemodel.csv]]

hmmm ... still not working

#+name: modelcardsBasemodels
#+call: modelcardsDownload(dataset="basemodel") :file "models_with_basemodel.csv"

It won't fetch from =#+call:= for some reason idk

#+name: modelcardsDatasets
#+call: modelcardsDownload(dataset="dataset") :file "models_with_dataset.csv"

*** COMMENT SQLite

#+name: egModelcards
#+header: :db (expand-file-name "hfmodelcards.sqlite" ob@huggingface_model_cards)
#+begin_src sqlite :results output table :var hfmcCsv="models_with_basemodel.csv"
drop table if exists model_cards;
create table model_cards (
huggingface_link varchar, -- not null,
downloads int not null, 
likes int not null, 
library_name varchar, -- not null,
pipeline_tag varchar, -- not null,
modelId varchar, -- not null,
private boolean not null,
createdAt datetime, -- not null,
arxiv_ids varchar, -- not null,
tags_cleaned varchar, -- not null,
dataset varchar -- not null
lics varchar, -- not null,
base_model varchar, -- not null,
);

.mode csv
.import $hfmcCsv model_cards

-- insert into model_cards
-- select huggingface_link
--        downloads
--        likes
--        library_name
--        pipeline_tag
--        modelId
--        private
--        createdAt when not null then datetime(createdAt) else null end,
--        arxiv_ids
--        tags_cleaned
--        dataset
--        lics
--        base_model
-- from $hfmcCsv;

select * from model_cards
where createdAt > (date('now') - date(createdAt) < 90)
and  createdAt > (date('now') - date(createdAt) > 30)
order by downloads desc
limit 50;
#+end_src

#+RESULTS: egModelcards
| https://huggingface.co/Ruben-F/bloodcelldiff                                      |       5 |    1 | yolo   | object-detection    | Ruben-F/bloodcelldiff                                      | FALSE | 2024-09-09T17:00:32.000Z | ['no arxiv id']      | ['yolo', 'vision', 'object-detection', 'base_model:Ultralytics/YOLOv8', 'base_model:finetune:Ultralytics/YOLOv8']                                                                                                                                                                                                                                                    | ['license:mit']        | []                                       | ['base_model:Ultralytics/YOLOv8', 'base_model:finetune:Ultralytics/YOLOv8']                                                        |
| https://huggingface.co/alibaba-pai/Wan2.2-Fun-A14B-Control                        |     366 |   57 | wan2.2 | image-to-video      | alibaba-pai/Wan2.2-Fun-A14B-Control                        | FALSE | 2025-08-05T02:40:12.000Z | ['no arxiv id']      | ['wan2.2', 'diffusers', 'safetensors', 'video', 'video-generation', 'image-to-video', 'en', 'zh', 'base_model:Wan-AI/Wan2.2-I2V-A14B', 'base_model:finetune:Wan-AI/Wan2.2-I2V-A14B']                                                                                                                                                                                 | ['license:apache-2.0'] | []                                       | ['base_model:Wan-AI/Wan2.2-I2V-A14B', 'base_model:finetune:Wan-AI/Wan2.2-I2V-A14B']                                                |
| https://huggingface.co/alibaba-pai/Wan2.2-VACE-Fun-A14B                           |     310 |   78 | wan2.2 | text-to-video       | alibaba-pai/Wan2.2-VACE-Fun-A14B                           | FALSE | 2025-09-10T06:30:42.000Z | ['no arxiv id']      | ['wan2.2', 'diffusers', 'safetensors', 'video', 'video-generation', 'text-to-video', 'en', 'zh', 'base_model:Wan-AI/Wan2.2-T2V-A14B', 'base_model:finetune:Wan-AI/Wan2.2-T2V-A14B']                                                                                                                                                                                  | ['license:apache-2.0'] | []                                       | ['base_model:Wan-AI/Wan2.2-T2V-A14B', 'base_model:finetune:Wan-AI/Wan2.2-T2V-A14B']                                                |
| https://huggingface.co/alibaba-pai/Wan2.2-Fun-A14B-InP                            |     140 |   20 | wan2.2 | image-to-video      | alibaba-pai/Wan2.2-Fun-A14B-InP                            | FALSE | 2025-08-05T02:39:59.000Z | ['no arxiv id']      | ['wan2.2', 'diffusers', 'safetensors', 'video', 'video-generation', 'image-to-video', 'en', 'zh', 'base_model:Wan-AI/Wan2.2-I2V-A14B', 'base_model:finetune:Wan-AI/Wan2.2-I2V-A14B']                                                                                                                                                                                 | ['license:apache-2.0'] | []                                       | ['base_model:Wan-AI/Wan2.2-I2V-A14B', 'base_model:finetune:Wan-AI/Wan2.2-I2V-A14B']                                                |
| https://huggingface.co/alibaba-pai/Wan2.2-Fun-A14B-Control-Camera                 |      87 |   19 | wan2.2 | text-to-video       | alibaba-pai/Wan2.2-Fun-A14B-Control-Camera                 | FALSE | 2025-08-11T11:36:13.000Z | ['no arxiv id']      | ['wan2.2', 'diffusers', 'safetensors', 'video', 'video-generation', 'text-to-video', 'en', 'zh', 'base_model:Wan-AI/Wan2.2-I2V-A14B', 'base_model:finetune:Wan-AI/Wan2.2-I2V-A14B']                                                                                                                                                                                  | ['license:apache-2.0'] | []                                       | ['base_model:Wan-AI/Wan2.2-I2V-A14B', 'base_model:finetune:Wan-AI/Wan2.2-I2V-A14B']                                                |
| https://huggingface.co/alibaba-pai/Wan2.2-Fun-5B-Control-Camera                   |      40 |    0 | wan2.2 | image-to-video      | alibaba-pai/Wan2.2-Fun-5B-Control-Camera                   | FALSE | 2025-08-19T06:24:14.000Z | ['no arxiv id']      | ['wan2.2', 'diffusers', 'safetensors', 'ti2v', 'video', 'video-generation', 'image-to-video', 'en', 'zh', 'base_model:Wan-AI/Wan2.2-TI2V-5B', 'base_model:finetune:Wan-AI/Wan2.2-TI2V-5B']                                                                                                                                                                           | ['license:apache-2.0'] | []                                       | ['base_model:Wan-AI/Wan2.2-TI2V-5B', 'base_model:finetune:Wan-AI/Wan2.2-TI2V-5B']                                                  |
| https://huggingface.co/alibaba-pai/Wan2.2-Fun-5B-Control                          |      49 |    5 | wan2.2 | image-to-video      | alibaba-pai/Wan2.2-Fun-5B-Control                          | FALSE | 2025-08-19T06:24:24.000Z | ['no arxiv id']      | ['wan2.2', 'diffusers', 'safetensors', 'ti2v', 'video', 'video-generation', 'image-to-video', 'en', 'zh', 'base_model:Wan-AI/Wan2.2-TI2V-5B', 'base_model:finetune:Wan-AI/Wan2.2-TI2V-5B']                                                                                                                                                                           | ['license:apache-2.0'] | []                                       | ['base_model:Wan-AI/Wan2.2-TI2V-5B', 'base_model:finetune:Wan-AI/Wan2.2-TI2V-5B']                                                  |
| https://huggingface.co/alibaba-pai/Wan2.2-Fun-5B-InP                              |      46 |    5 | wan2.2 | image-to-video      | alibaba-pai/Wan2.2-Fun-5B-InP                              | FALSE | 2025-08-19T06:27:03.000Z | ['no arxiv id']      | ['wan2.2', 'diffusers', 'safetensors', 'i2v', 'video', 'video-generation', 'image-to-video', 'en', 'zh', 'base_model:Wan-AI/Wan2.2-TI2V-5B', 'base_model:finetune:Wan-AI/Wan2.2-TI2V-5B']                                                                                                                                                                            | ['license:apache-2.0'] | []                                       | ['base_model:Wan-AI/Wan2.2-TI2V-5B', 'base_model:finetune:Wan-AI/Wan2.2-TI2V-5B']                                                  |
| https://huggingface.co/openbmb/VoxCPM-0.5B                                        |    5708 |  713 | voxcpm | text-to-speech      | openbmb/VoxCPM-0.5B                                        | FALSE | 2025-09-16T06:56:48.000Z | ['no arxiv id']      | ['voxcpm', 'pytorch', 'text-to-speech', 'speech', 'speech generation', 'voice cloning', 'en', 'zh', 'base_model:openbmb/MiniCPM4-0.5B', 'base_model:finetune:openbmb/MiniCPM4-0.5B']                                                                                                                                                                                 | ['license:apache-2.0'] | []                                       | ['base_model:openbmb/MiniCPM4-0.5B', 'base_model:finetune:openbmb/MiniCPM4-0.5B']                                                  |
| https://huggingface.co/mistralai/Magistral-Small-2509                             |   18825 |  220 | vllm   |                     | mistralai/Magistral-Small-2509                             | FALSE | 2025-09-12T09:45:10.000Z | ['arxiv:2506.10910'] | ['vllm', 'safetensors', 'mistral3', 'mistral-common', 'en', 'fr', 'de', 'es', 'pt', 'it', 'ja', 'ko', 'ru', 'zh', 'ar', 'fa', 'id', 'ms', 'ne', 'pl', 'ro', 'sr', 'sv', 'tr', 'uk', 'vi', 'hi', 'bn', 'arxiv:2506.10910', 'base_model:mistralai/Mistral-Small-3.2-24B-Instruct-2506', 'base_model:finetune:mistralai/Mistral-Small-3.2-24B-Instruct-2506']           | ['license:apache-2.0'] | []                                       | ['base_model:mistralai/Mistral-Small-3.2-24B-Instruct-2506', 'base_model:finetune:mistralai/Mistral-Small-3.2-24B-Instruct-2506']  |
| https://huggingface.co/mistralai/Mistral-7B-Instruct-v0.3                         |  714156 | 2139 | vllm   |                     | mistralai/Mistral-7B-Instruct-v0.3                         | FALSE | 2024-05-22T09:57:04.000Z | ['no arxiv id']      | ['vllm', 'safetensors', 'mistral', 'mistral-common', 'base_model:mistralai/Mistral-7B-v0.3', 'base_model:finetune:mistralai/Mistral-7B-v0.3']                                                                                                                                                                                                                        | ['license:apache-2.0'] | []                                       | ['base_model:mistralai/Mistral-7B-v0.3', 'base_model:finetune:mistralai/Mistral-7B-v0.3']                                          |
| https://huggingface.co/unsloth/Magistral-Small-2509-GGUF                          |   57467 |   70 | vllm   |                     | unsloth/Magistral-Small-2509-GGUF                          | FALSE | 2025-09-17T12:14:20.000Z | ['arxiv:2506.10910'] | ['vllm', 'gguf', 'mistral-common', 'unsloth', 'en', 'fr', 'de', 'es', 'pt', 'it', 'ja', 'ko', 'ru', 'zh', 'ar', 'fa', 'id', 'ms', 'ne', 'pl', 'ro', 'sr', 'sv', 'tr', 'uk', 'vi', 'hi', 'bn', 'arxiv:2506.10910', 'base_model:mistralai/Magistral-Small-2509', 'base_model:quantized:mistralai/Magistral-Small-2509', 'conversational']                              | ['license:apache-2.0'] | []                                       | ['base_model:mistralai/Magistral-Small-2509', 'base_model:quantized:mistralai/Magistral-Small-2509']                               |
| https://huggingface.co/mistralai/Mixtral-8x7B-Instruct-v0.1                       |  299113 | 4568 | vllm   |                     | mistralai/Mixtral-8x7B-Instruct-v0.1                       | FALSE | 2023-12-10T18:47:12.000Z | ['no arxiv id']      | ['vllm', 'safetensors', 'mixtral', 'fr', 'it', 'de', 'es', 'en', 'base_model:mistralai/Mixtral-8x7B-v0.1', 'base_model:finetune:mistralai/Mixtral-8x7B-v0.1']                                                                                                                                                                                                        | ['license:apache-2.0'] | []                                       | ['base_model:mistralai/Mixtral-8x7B-v0.1', 'base_model:finetune:mistralai/Mixtral-8x7B-v0.1']                                      |
| https://huggingface.co/mistralai/Mistral-Small-3.2-24B-Instruct-2506              |  158380 |  472 | vllm   |                     | mistralai/Mistral-Small-3.2-24B-Instruct-2506              | FALSE | 2025-06-19T17:41:13.000Z | ['no arxiv id']      | ['vllm', 'safetensors', 'mistral3', 'mistral-common', 'en', 'fr', 'de', 'es', 'pt', 'it', 'ja', 'ko', 'ru', 'zh', 'ar', 'fa', 'id', 'ms', 'ne', 'pl', 'ro', 'sr', 'sv', 'tr', 'uk', 'vi', 'hi', 'bn', 'base_model:mistralai/Mistral-Small-3.1-24B-Base-2503', 'base_model:finetune:mistralai/Mistral-Small-3.1-24B-Base-2503']                                       | ['license:apache-2.0'] | []                                       | ['base_model:mistralai/Mistral-Small-3.1-24B-Base-2503', 'base_model:finetune:mistralai/Mistral-Small-3.1-24B-Base-2503']          |
| https://huggingface.co/mistralai/Mistral-Nemo-Instruct-2407                       |   76716 | 1595 | vllm   |                     | mistralai/Mistral-Nemo-Instruct-2407                       | FALSE | 2024-07-17T17:26:49.000Z | ['no arxiv id']      | ['vllm', 'safetensors', 'mistral', 'mistral-common', 'en', 'fr', 'de', 'es', 'it', 'pt', 'ru', 'zh', 'ja', 'base_model:mistralai/Mistral-Nemo-Base-2407', 'base_model:finetune:mistralai/Mistral-Nemo-Base-2407']                                                                                                                                                    | ['license:apache-2.0'] | []                                       | ['base_model:mistralai/Mistral-Nemo-Base-2407', 'base_model:finetune:mistralai/Mistral-Nemo-Base-2407']                            |
| https://huggingface.co/unsloth/Mistral-Small-3.2-24B-Instruct-2506-GGUF           |   73572 |  114 | vllm   | image-text-to-text  | unsloth/Mistral-Small-3.2-24B-Instruct-2506-GGUF           | FALSE | 2025-06-20T22:27:21.000Z | ['no arxiv id']      | ['vllm', 'gguf', 'image-text-to-text', 'en', 'fr', 'de', 'es', 'pt', 'it', 'ja', 'ko', 'ru', 'zh', 'ar', 'fa', 'id', 'ms', 'ne', 'pl', 'ro', 'sr', 'sv', 'tr', 'uk', 'vi', 'hi', 'bn', 'base_model:mistralai/Mistral-Small-3.2-24B-Instruct-2506', 'base_model:quantized:mistralai/Mistral-Small-3.2-24B-Instruct-2506', 'conversational']                           | ['license:apache-2.0'] | []                                       | ['base_model:mistralai/Mistral-Small-3.2-24B-Instruct-2506', 'base_model:quantized:mistralai/Mistral-Small-3.2-24B-Instruct-2506'] |
| https://huggingface.co/unsloth/Magistral-Small-2509                               |    1358 |    8 | vllm   |                     | unsloth/Magistral-Small-2509                               | FALSE | 2025-09-17T10:58:51.000Z | ['arxiv:2506.10910'] | ['vllm', 'safetensors', 'mistral3', 'mistral-common', 'en', 'fr', 'de', 'es', 'pt', 'it', 'ja', 'ko', 'ru', 'zh', 'ar', 'fa', 'id', 'ms', 'ne', 'pl', 'ro', 'sr', 'sv', 'tr', 'uk', 'vi', 'hi', 'bn', 'arxiv:2506.10910', 'base_model:mistralai/Magistral-Small-2509', 'base_model:finetune:mistralai/Magistral-Small-2509']                                         | ['license:apache-2.0'] | []                                       | ['base_model:mistralai/Magistral-Small-2509', 'base_model:finetune:mistralai/Magistral-Small-2509']                                |
| https://huggingface.co/mistralai/Mistral-Small-24B-Instruct-2501                  | 1047597 |  944 | vllm   |                     | mistralai/Mistral-Small-24B-Instruct-2501                  | FALSE | 2025-01-28T13:30:13.000Z | ['no arxiv id']      | ['vllm', 'safetensors', 'mistral', 'en', 'fr', 'de', 'es', 'it', 'pt', 'zh', 'ja', 'ru', 'ko', 'base_model:mistralai/Mistral-Small-24B-Base-2501', 'base_model:finetune:mistralai/Mistral-Small-24B-Base-2501']                                                                                                                                                      | ['license:apache-2.0'] | []                                       | ['base_model:mistralai/Mistral-Small-24B-Base-2501', 'base_model:finetune:mistralai/Mistral-Small-24B-Base-2501']                  |
| https://huggingface.co/unsloth/Devstral-Small-2507-GGUF                           |   20094 |   61 | vllm   | text-generation     | unsloth/Devstral-Small-2507-GGUF                           | FALSE | 2025-07-10T13:20:40.000Z | ['no arxiv id']      | ['vllm', 'gguf', 'mistral3', 'text2text-generation', 'en', 'fr', 'de', 'es', 'pt', 'it', 'ja', 'ko', 'ru', 'zh', 'ar', 'fa', 'id', 'ms', 'ne', 'pl', 'ro', 'sr', 'sv', 'tr', 'uk', 'vi', 'hi', 'bn', 'base_model:mistralai/Devstral-Small-2507', 'base_model:quantized:mistralai/Devstral-Small-2507', 'conversational']                                             | ['license:apache-2.0'] | []                                       | ['base_model:mistralai/Devstral-Small-2507', 'base_model:quantized:mistralai/Devstral-Small-2507']                                 |
| https://huggingface.co/mistralai/Pixtral-12B-2409                                 |    4929 |  666 | vllm   |                     | mistralai/Pixtral-12B-2409                                 | FALSE | 2024-09-11T18:11:16.000Z | ['no arxiv id']      | ['vllm', 'mistral-common', 'en', 'fr', 'de', 'es', 'it', 'pt', 'ru', 'zh', 'ja', 'base_model:mistralai/Pixtral-12B-Base-2409', 'base_model:finetune:mistralai/Pixtral-12B-Base-2409']                                                                                                                                                                                | ['license:apache-2.0'] | []                                       | ['base_model:mistralai/Pixtral-12B-Base-2409', 'base_model:finetune:mistralai/Pixtral-12B-Base-2409']                              |
| https://huggingface.co/mistralai/Devstral-Small-2505                              |   12835 |  852 | vllm   |                     | mistralai/Devstral-Small-2505                              | FALSE | 2025-05-12T21:49:21.000Z | ['no arxiv id']      | ['vllm', 'safetensors', 'mistral', 'mistral-common', 'en', 'fr', 'de', 'es', 'pt', 'it', 'ja', 'ko', 'ru', 'zh', 'ar', 'fa', 'id', 'ms', 'ne', 'pl', 'ro', 'sr', 'sv', 'tr', 'uk', 'vi', 'hi', 'bn', 'base_model:mistralai/Mistral-Small-3.1-24B-Instruct-2503', 'base_model:finetune:mistralai/Mistral-Small-3.1-24B-Instruct-2503']                                | ['license:apache-2.0'] | []                                       | ['base_model:mistralai/Mistral-Small-3.1-24B-Instruct-2503', 'base_model:finetune:mistralai/Mistral-Small-3.1-24B-Instruct-2503']  |
| https://huggingface.co/huihui-ai/Magistral-Small-2506-abliterated                 |      76 |   14 | vllm   | text-generation     | huihui-ai/Magistral-Small-2506-abliterated                 | FALSE | 2025-06-13T08:04:04.000Z | ['no arxiv id']      | ['vllm', 'safetensors', 'mistral', 'chat', 'abliterated', 'uncensored', 'text2text-generation', 'conversational', 'en', 'fr', 'de', 'es', 'pt', 'it', 'ja', 'ko', 'ru', 'zh', 'ar', 'fa', 'id', 'ms', 'ne', 'pl', 'ro', 'sr', 'sv', 'tr', 'uk', 'vi', 'hi', 'bn', 'base_model:mistralai/Magistral-Small-2506', 'base_model:finetune:mistralai/Magistral-Small-2506'] | ['license:apache-2.0'] | []                                       | ['base_model:mistralai/Magistral-Small-2506', 'base_model:finetune:mistralai/Magistral-Small-2506']                                |
| https://huggingface.co/mistralai/Voxtral-Small-24B-2507                           |   10216 |  405 | vllm   | audio-text-to-text  | mistralai/Voxtral-Small-24B-2507                           | FALSE | 2025-07-01T14:11:59.000Z | ['arxiv:2507.13264'] | ['vllm', 'safetensors', 'voxtral', 'audio-text-to-text', 'en', 'fr', 'de', 'es', 'it', 'pt', 'nl', 'hi', 'arxiv:2507.13264', 'base_model:mistralai/Mistral-Small-24B-Base-2501', 'base_model:finetune:mistralai/Mistral-Small-24B-Base-2501']                                                                                                                        | ['license:apache-2.0'] | []                                       | ['base_model:mistralai/Mistral-Small-24B-Base-2501', 'base_model:finetune:mistralai/Mistral-Small-24B-Base-2501']                  |
| https://huggingface.co/unsloth/Magistral-Small-2509-unsloth-bnb-4bit              |    2680 |    4 | vllm   |                     | unsloth/Magistral-Small-2509-unsloth-bnb-4bit              | FALSE | 2025-09-17T12:17:24.000Z | ['arxiv:2506.10910'] | ['vllm', 'safetensors', 'mistral3', 'mistral-common', 'unsloth', 'en', 'fr', 'de', 'es', 'pt', 'it', 'ja', 'ko', 'ru', 'zh', 'ar', 'fa', 'id', 'ms', 'ne', 'pl', 'ro', 'sr', 'sv', 'tr', 'uk', 'vi', 'hi', 'bn', 'arxiv:2506.10910', 'base_model:mistralai/Magistral-Small-2509', 'base_model:quantized:mistralai/Magistral-Small-2509', '4-bit', 'bitsandbytes']    | ['license:apache-2.0'] | []                                       | ['base_model:mistralai/Magistral-Small-2509', 'base_model:quantized:mistralai/Magistral-Small-2509']                               |
| https://huggingface.co/lmstudio-community/Magistral-Small-2509-MLX-8bit           |  425975 |    1 | vllm   |                     | lmstudio-community/Magistral-Small-2509-MLX-8bit           | FALSE | 2025-09-17T22:15:03.000Z | ['no arxiv id']      | ['vllm', 'safetensors', 'mistral3', 'mistral-common', 'mlx', 'en', 'fr', 'de', 'es', 'pt', 'it', 'ja', 'ko', 'ru', 'zh', 'ar', 'fa', 'id', 'ms', 'ne', 'pl', 'ro', 'sr', 'sv', 'tr', 'uk', 'vi', 'hi', 'bn', 'base_model:mistralai/Magistral-Small-2509', 'base_model:quantized:mistralai/Magistral-Small-2509', '8-bit']                                            | ['license:apache-2.0'] | []                                       | ['base_model:mistralai/Magistral-Small-2509', 'base_model:quantized:mistralai/Magistral-Small-2509']                               |
| https://huggingface.co/AlexanderKyng/Devstral-Small-2507-int4-AutoRound           |      28 |    1 | vllm   | text-generation     | AlexanderKyng/Devstral-Small-2507-int4-AutoRound           | FALSE | 2025-09-19T11:55:58.000Z | ['no arxiv id']      | ['vllm', 'safetensors', 'mistral', 'text-generation', 'en', 'fr', 'de', 'es', 'pt', 'it', 'ja', 'ko', 'ru', 'zh', 'ar', 'fa', 'id', 'ms', 'ne', 'pl', 'ro', 'sr', 'sv', 'tr', 'uk', 'vi', 'hi', 'bn', 'base_model:mistralai/Devstral-Small-2507', 'base_model:quantized:mistralai/Devstral-Small-2507', '4-bit', 'auto-round']                                       | ['license:apache-2.0'] | []                                       | ['base_model:mistralai/Devstral-Small-2507', 'base_model:quantized:mistralai/Devstral-Small-2507']                                 |
| https://huggingface.co/cpatonn/Magistral-Small-2509-AWQ-8bit                      |     753 |    1 | vllm   |                     | cpatonn/Magistral-Small-2509-AWQ-8bit                      | FALSE | 2025-09-20T18:28:11.000Z | ['arxiv:2506.10910'] | ['vllm', 'safetensors', 'mistral3', 'mistral-common', 'en', 'fr', 'de', 'es', 'pt', 'it', 'ja', 'ko', 'ru', 'zh', 'ar', 'fa', 'id', 'ms', 'ne', 'pl', 'ro', 'sr', 'sv', 'tr', 'uk', 'vi', 'hi', 'bn', 'arxiv:2506.10910', 'base_model:mistralai/Magistral-Small-2509', 'base_model:quantized:mistralai/Magistral-Small-2509', 'compressed-tensors']                  | ['license:apache-2.0'] | []                                       | ['base_model:mistralai/Magistral-Small-2509', 'base_model:quantized:mistralai/Magistral-Small-2509']                               |
| https://huggingface.co/mistralai/Mixtral-8x22B-Instruct-v0.1                      |   11898 |  733 | vllm   |                     | mistralai/Mixtral-8x22B-Instruct-v0.1                      | FALSE | 2024-04-16T20:08:01.000Z | ['no arxiv id']      | ['vllm', 'safetensors', 'mixtral', 'mistral-common', 'en', 'es', 'it', 'de', 'fr', 'base_model:mistralai/Mixtral-8x22B-v0.1', 'base_model:finetune:mistralai/Mixtral-8x22B-v0.1']                                                                                                                                                                                    | ['license:apache-2.0'] | []                                       | ['base_model:mistralai/Mixtral-8x22B-v0.1', 'base_model:finetune:mistralai/Mixtral-8x22B-v0.1']                                    |
| https://huggingface.co/RedHatAI/pixtral-12b-FP8-dynamic                           |     979 |   10 | vllm   | text-generation     | RedHatAI/pixtral-12b-FP8-dynamic                           | FALSE | 2024-10-10T18:52:20.000Z | ['no arxiv id']      | ['vllm', 'safetensors', 'llava', 'fp8', 'text-generation', 'conversational', 'en', 'de', 'fr', 'it', 'pt', 'hi', 'es', 'th', 'base_model:mistral-community/pixtral-12b', 'base_model:quantized:mistral-community/pixtral-12b', 'compressed-tensors']                                                                                                                 | ['license:apache-2.0'] | []                                       | ['base_model:mistral-community/pixtral-12b', 'base_model:quantized:mistral-community/pixtral-12b']                                 |
| https://huggingface.co/nintwentydo/pixtral-12b-FP8-dynamic-FP8-KV-cache           |       3 |    1 | vllm   | image-text-to-text  | nintwentydo/pixtral-12b-FP8-dynamic-FP8-KV-cache           | FALSE | 2024-12-29T03:38:10.000Z | ['no arxiv id']      | ['vllm', 'safetensors', 'llava', 'fp8', 'image-text-to-text', 'conversational', 'en', 'de', 'fr', 'it', 'pt', 'hi', 'es', 'th', 'dataset:HuggingFaceH4/ultrachat_200k', 'base_model:mistral-community/pixtral-12b', 'base_model:quantized:mistral-community/pixtral-12b', 'compressed-tensors']                                                                      | ['license:apache-2.0'] | ['dataset:HuggingFaceH4/ultrachat_200k'] | ['base_model:mistral-community/pixtral-12b', 'base_model:quantized:mistral-community/pixtral-12b']                                 |
| https://huggingface.co/nintwentydo/pixtral-12b-2409-2of4-sparse                   |       4 |    1 | vllm   | image-text-to-text  | nintwentydo/pixtral-12b-2409-2of4-sparse                   | FALSE | 2025-01-05T06:23:24.000Z | ['no arxiv id']      | ['vllm', 'safetensors', 'llava', 'sparsity', 'image-text-to-text', 'conversational', 'en', 'de', 'fr', 'it', 'pt', 'hi', 'es', 'th', 'base_model:mistral-community/pixtral-12b', 'base_model:quantized:mistral-community/pixtral-12b', 'compressed-tensors']                                                                                                         | ['license:apache-2.0'] | []                                       | ['base_model:mistral-community/pixtral-12b', 'base_model:quantized:mistral-community/pixtral-12b']                                 |
| https://huggingface.co/nintwentydo/pixtral-12b-2409-W4A16-G128                    |       4 |    2 | vllm   | image-text-to-text  | nintwentydo/pixtral-12b-2409-W4A16-G128                    | FALSE | 2025-01-05T07:38:53.000Z | ['no arxiv id']      | ['vllm', 'safetensors', 'llava', 'int4', 'image-text-to-text', 'conversational', 'en', 'de', 'fr', 'it', 'pt', 'hi', 'es', 'th', 'base_model:mistral-community/pixtral-12b', 'base_model:quantized:mistral-community/pixtral-12b', 'compressed-tensors']                                                                                                             | ['license:apache-2.0'] | []                                       | ['base_model:mistral-community/pixtral-12b', 'base_model:quantized:mistral-community/pixtral-12b']                                 |
| https://huggingface.co/nikitagreb/test-upload                                     |       3 |    0 | vllm   | text-classification | nikitagreb/test-upload                                     | FALSE | 2025-01-29T12:33:50.000Z | ['no arxiv id']      | ['vllm', 'safetensors', 'bert', 'text-classification', 'transformers', 'en', 'fr', 'de', 'es', 'it', 'pt', 'zh', 'ja', 'ru', 'ko', 'base_model:mistralai/Mistral-Small-24B-Base-2501', 'base_model:finetune:mistralai/Mistral-Small-24B-Base-2501']                                                                                                                  | ['license:apache-2.0'] | []                                       | ['base_model:mistralai/Mistral-Small-24B-Base-2501', 'base_model:finetune:mistralai/Mistral-Small-24B-Base-2501']                  |
| https://huggingface.co/mlx-community/Mistral-Small-24B-Instruct-2501-bf16         |      32 |    6 | vllm   |                     | mlx-community/Mistral-Small-24B-Instruct-2501-bf16         | FALSE | 2025-01-30T14:46:12.000Z | ['no arxiv id']      | ['vllm', 'safetensors', 'mistral', 'mlx', 'en', 'fr', 'de', 'es', 'it', 'pt', 'zh', 'ja', 'ru', 'ko', 'base_model:mistralai/Mistral-Small-24B-Instruct-2501', 'base_model:finetune:mistralai/Mistral-Small-24B-Instruct-2501']                                                                                                                                       | ['license:apache-2.0'] | []                                       | ['base_model:mistralai/Mistral-Small-24B-Instruct-2501', 'base_model:finetune:mistralai/Mistral-Small-24B-Instruct-2501']          |
| https://huggingface.co/mlx-community/Mistral-Small-24B-Instruct-2501-4bit         |     157 |   14 | vllm   |                     | mlx-community/Mistral-Small-24B-Instruct-2501-4bit         | FALSE | 2025-01-30T14:46:19.000Z | ['no arxiv id']      | ['vllm', 'safetensors', 'mistral', 'mlx', 'en', 'fr', 'de', 'es', 'it', 'pt', 'zh', 'ja', 'ru', 'ko', 'base_model:mistralai/Mistral-Small-24B-Instruct-2501', 'base_model:quantized:mistralai/Mistral-Small-24B-Instruct-2501', '4-bit']                                                                                                                             | ['license:apache-2.0'] | []                                       | ['base_model:mistralai/Mistral-Small-24B-Instruct-2501', 'base_model:quantized:mistralai/Mistral-Small-24B-Instruct-2501']         |
| https://huggingface.co/mlx-community/Mistral-Small-24B-Instruct-2501-3bit         |      39 |    2 | vllm   |                     | mlx-community/Mistral-Small-24B-Instruct-2501-3bit         | FALSE | 2025-01-30T14:46:25.000Z | ['no arxiv id']      | ['vllm', 'safetensors', 'mistral', 'mlx', 'en', 'fr', 'de', 'es', 'it', 'pt', 'zh', 'ja', 'ru', 'ko', 'base_model:mistralai/Mistral-Small-24B-Instruct-2501', 'base_model:quantized:mistralai/Mistral-Small-24B-Instruct-2501', '3-bit']                                                                                                                             | ['license:apache-2.0'] | []                                       | ['base_model:mistralai/Mistral-Small-24B-Instruct-2501', 'base_model:quantized:mistralai/Mistral-Small-24B-Instruct-2501']         |
| https://huggingface.co/mlx-community/Mistral-Small-24B-Instruct-2501-6bit         |       7 |    0 | vllm   |                     | mlx-community/Mistral-Small-24B-Instruct-2501-6bit         | FALSE | 2025-01-30T14:46:33.000Z | ['no arxiv id']      | ['vllm', 'safetensors', 'mistral', 'mlx', 'en', 'fr', 'de', 'es', 'it', 'pt', 'zh', 'ja', 'ru', 'ko', 'base_model:mistralai/Mistral-Small-24B-Instruct-2501', 'base_model:quantized:mistralai/Mistral-Small-24B-Instruct-2501', '6-bit']                                                                                                                             | ['license:apache-2.0'] | []                                       | ['base_model:mistralai/Mistral-Small-24B-Instruct-2501', 'base_model:quantized:mistralai/Mistral-Small-24B-Instruct-2501']         |
| https://huggingface.co/mlx-community/Mistral-Small-24B-Instruct-2501-8bit         |      24 |    3 | vllm   |                     | mlx-community/Mistral-Small-24B-Instruct-2501-8bit         | FALSE | 2025-01-30T14:46:38.000Z | ['no arxiv id']      | ['vllm', 'safetensors', 'mistral', 'mlx', 'en', 'fr', 'de', 'es', 'it', 'pt', 'zh', 'ja', 'ru', 'ko', 'base_model:mistralai/Mistral-Small-24B-Instruct-2501', 'base_model:quantized:mistralai/Mistral-Small-24B-Instruct-2501', '8-bit']                                                                                                                             | ['license:apache-2.0'] | []                                       | ['base_model:mistralai/Mistral-Small-24B-Instruct-2501', 'base_model:quantized:mistralai/Mistral-Small-24B-Instruct-2501']         |
| https://huggingface.co/adamo1139/Mistral-Small-24B-Instruct-2501-ungated          |      45 |    1 | vllm   |                     | adamo1139/Mistral-Small-24B-Instruct-2501-ungated          | FALSE | 2025-01-30T14:46:42.000Z | ['no arxiv id']      | ['vllm', 'safetensors', 'mistral', 'en', 'fr', 'de', 'es', 'it', 'pt', 'zh', 'ja', 'ru', 'ko', 'base_model:mistralai/Mistral-Small-24B-Base-2501', 'base_model:finetune:mistralai/Mistral-Small-24B-Base-2501']                                                                                                                                                      | ['license:apache-2.0'] | []                                       | ['base_model:mistralai/Mistral-Small-24B-Base-2501', 'base_model:finetune:mistralai/Mistral-Small-24B-Base-2501']                  |
| https://huggingface.co/NikolayKozloff/Mistral-Small-24B-Instruct-2501-Q2_K-GGUF   |       3 |    2 | vllm   |                     | NikolayKozloff/Mistral-Small-24B-Instruct-2501-Q2_K-GGUF   | FALSE | 2025-01-30T14:51:22.000Z | ['no arxiv id']      | ['vllm', 'gguf', 'llama-cpp', 'gguf-my-repo', 'en', 'fr', 'de', 'es', 'it', 'pt', 'zh', 'ja', 'ru', 'ko', 'base_model:mistralai/Mistral-Small-24B-Instruct-2501', 'base_model:quantized:mistralai/Mistral-Small-24B-Instruct-2501', 'endpoints_compatible', 'conversational']                                                                                        | ['license:apache-2.0'] | []                                       | ['base_model:mistralai/Mistral-Small-24B-Instruct-2501', 'base_model:quantized:mistralai/Mistral-Small-24B-Instruct-2501']         |
| https://huggingface.co/Karsh-CAI/Mistral-Small-24B-Instruct-2501-Q8_0-GGUF        |       7 |    2 | vllm   |                     | Karsh-CAI/Mistral-Small-24B-Instruct-2501-Q8_0-GGUF        | FALSE | 2025-01-30T14:58:55.000Z | ['no arxiv id']      | ['vllm', 'gguf', 'llama-cpp', 'gguf-my-repo', 'en', 'fr', 'de', 'es', 'it', 'pt', 'zh', 'ja', 'ru', 'ko', 'base_model:mistralai/Mistral-Small-24B-Instruct-2501', 'base_model:quantized:mistralai/Mistral-Small-24B-Instruct-2501', 'endpoints_compatible', 'conversational']                                                                                        | ['license:apache-2.0'] | []                                       | ['base_model:mistralai/Mistral-Small-24B-Instruct-2501', 'base_model:quantized:mistralai/Mistral-Small-24B-Instruct-2501']         |
| https://huggingface.co/NikolayKozloff/Mistral-Small-24B-Instruct-2501-Q3_K_S-GGUF |       1 |    1 | vllm   |                     | NikolayKozloff/Mistral-Small-24B-Instruct-2501-Q3_K_S-GGUF | FALSE | 2025-01-30T15:25:34.000Z | ['no arxiv id']      | ['vllm', 'gguf', 'llama-cpp', 'gguf-my-repo', 'en', 'fr', 'de', 'es', 'it', 'pt', 'zh', 'ja', 'ru', 'ko', 'base_model:mistralai/Mistral-Small-24B-Instruct-2501', 'base_model:quantized:mistralai/Mistral-Small-24B-Instruct-2501', 'endpoints_compatible', 'conversational']                                                                                        | ['license:apache-2.0'] | []                                       | ['base_model:mistralai/Mistral-Small-24B-Instruct-2501', 'base_model:quantized:mistralai/Mistral-Small-24B-Instruct-2501']         |
| https://huggingface.co/hasanbasbunar/Mistral-Small-24B-Instruct-2501-Q4_0-GGUF    |      19 |    2 | vllm   |                     | hasanbasbunar/Mistral-Small-24B-Instruct-2501-Q4_0-GGUF    | FALSE | 2025-01-30T15:44:36.000Z | ['no arxiv id']      | ['vllm', 'gguf', 'llama-cpp', 'gguf-my-repo', 'en', 'fr', 'de', 'es', 'it', 'pt', 'zh', 'ja', 'ru', 'ko', 'base_model:mistralai/Mistral-Small-24B-Instruct-2501', 'base_model:quantized:mistralai/Mistral-Small-24B-Instruct-2501', 'endpoints_compatible', 'conversational']                                                                                        | ['license:apache-2.0'] | []                                       | ['base_model:mistralai/Mistral-Small-24B-Instruct-2501', 'base_model:quantized:mistralai/Mistral-Small-24B-Instruct-2501']         |
| https://huggingface.co/phate334/Mistral-Small-24B-Instruct-2501-Q4_K_M-GGUF       |      24 |    0 | vllm   |                     | phate334/Mistral-Small-24B-Instruct-2501-Q4_K_M-GGUF       | FALSE | 2025-01-30T16:09:50.000Z | ['no arxiv id']      | ['vllm', 'gguf', 'llama-cpp', 'gguf-my-repo', 'en', 'fr', 'de', 'es', 'it', 'pt', 'zh', 'ja', 'ru', 'ko', 'base_model:mistralai/Mistral-Small-24B-Instruct-2501', 'base_model:quantized:mistralai/Mistral-Small-24B-Instruct-2501', 'endpoints_compatible', 'conversational']                                                                                        | ['license:apache-2.0'] | []                                       | ['base_model:mistralai/Mistral-Small-24B-Instruct-2501', 'base_model:quantized:mistralai/Mistral-Small-24B-Instruct-2501']         |
| https://huggingface.co/venkycs/Mistral-Small-24B-Instruct-2501-Abliterated        |      16 |    0 | vllm   | text-generation     | venkycs/Mistral-Small-24B-Instruct-2501-Abliterated        | FALSE | 2025-01-30T16:32:09.000Z | ['no arxiv id']      | ['vllm', 'safetensors', 'mistral', 'text-generation', 'abliterated', 'uncensored', 'transformers', 'conversational', 'en', 'fr', 'de', 'es', 'it', 'pt', 'zh', 'ja', 'ru', 'ko', 'base_model:mistralai/Mistral-Small-24B-Instruct-2501', 'base_model:finetune:mistralai/Mistral-Small-24B-Instruct-2501', 'text-generation-inference']                               | ['license:apache-2.0'] | []                                       | ['base_model:mistralai/Mistral-Small-24B-Instruct-2501', 'base_model:finetune:mistralai/Mistral-Small-24B-Instruct-2501']          |
| https://huggingface.co/hasanbasbunar/Mistral-Small-24B-Instruct-2501-Q2_K-GGUF    |       2 |    1 | vllm   |                     | hasanbasbunar/Mistral-Small-24B-Instruct-2501-Q2_K-GGUF    | FALSE | 2025-01-30T16:32:57.000Z | ['no arxiv id']      | ['vllm', 'gguf', 'transformers', 'llama-cpp', 'gguf-my-repo', 'en', 'fr', 'de', 'es', 'it', 'pt', 'zh', 'ja', 'ru', 'ko', 'base_model:mistralai/Mistral-Small-24B-Instruct-2501', 'base_model:quantized:mistralai/Mistral-Small-24B-Instruct-2501', 'conversational']                                                                                                | ['license:apache-2.0'] | []                                       | ['base_model:mistralai/Mistral-Small-24B-Instruct-2501', 'base_model:quantized:mistralai/Mistral-Small-24B-Instruct-2501']         |
| https://huggingface.co/Triangle104/Mistral-Small-24B-Instruct-2501-Q4_K_S-GGUF    |      25 |    0 | vllm   |                     | Triangle104/Mistral-Small-24B-Instruct-2501-Q4_K_S-GGUF    | FALSE | 2025-01-30T16:44:15.000Z | ['no arxiv id']      | ['vllm', 'gguf', 'transformers', 'llama-cpp', 'gguf-my-repo', 'en', 'fr', 'de', 'es', 'it', 'pt', 'zh', 'ja', 'ru', 'ko', 'base_model:mistralai/Mistral-Small-24B-Instruct-2501', 'base_model:quantized:mistralai/Mistral-Small-24B-Instruct-2501', 'conversational']                                                                                                | ['license:apache-2.0'] | []                                       | ['base_model:mistralai/Mistral-Small-24B-Instruct-2501', 'base_model:quantized:mistralai/Mistral-Small-24B-Instruct-2501']         |
| https://huggingface.co/Triangle104/Mistral-Small-24B-Instruct-2501-Q4_K_M-GGUF    |       6 |    0 | vllm   |                     | Triangle104/Mistral-Small-24B-Instruct-2501-Q4_K_M-GGUF    | FALSE | 2025-01-30T16:55:17.000Z | ['no arxiv id']      | ['vllm', 'gguf', 'transformers', 'llama-cpp', 'gguf-my-repo', 'en', 'fr', 'de', 'es', 'it', 'pt', 'zh', 'ja', 'ru', 'ko', 'base_model:mistralai/Mistral-Small-24B-Instruct-2501', 'base_model:quantized:mistralai/Mistral-Small-24B-Instruct-2501', 'conversational']                                                                                                | ['license:apache-2.0'] | []                                       | ['base_model:mistralai/Mistral-Small-24B-Instruct-2501', 'base_model:quantized:mistralai/Mistral-Small-24B-Instruct-2501']         |
| https://huggingface.co/Triangle104/Mistral-Small-24B-Instruct-2501-Q5_K_S-GGUF    |       2 |    1 | vllm   |                     | Triangle104/Mistral-Small-24B-Instruct-2501-Q5_K_S-GGUF    | FALSE | 2025-01-30T17:11:19.000Z | ['no arxiv id']      | ['vllm', 'gguf', 'transformers', 'llama-cpp', 'gguf-my-repo', 'en', 'fr', 'de', 'es', 'it', 'pt', 'zh', 'ja', 'ru', 'ko', 'base_model:mistralai/Mistral-Small-24B-Instruct-2501', 'base_model:quantized:mistralai/Mistral-Small-24B-Instruct-2501', 'conversational']                                                                                                | ['license:apache-2.0'] | []                                       | ['base_model:mistralai/Mistral-Small-24B-Instruct-2501', 'base_model:quantized:mistralai/Mistral-Small-24B-Instruct-2501']         |
| https://huggingface.co/lolnoyarite/Mistral-Small-24B-Base-2501-Q4_K_M-GGUF        |      20 |    1 | vllm   |                     | lolnoyarite/Mistral-Small-24B-Base-2501-Q4_K_M-GGUF        | FALSE | 2025-01-30T17:22:50.000Z | ['no arxiv id']      | ['vllm', 'gguf', 'transformers', 'llama-cpp', 'gguf-my-repo', 'en', 'fr', 'de', 'es', 'it', 'pt', 'zh', 'ja', 'ru', 'ko', 'base_model:mistralai/Mistral-Small-24B-Base-2501', 'base_model:quantized:mistralai/Mistral-Small-24B-Base-2501']                                                                                                                          | ['license:apache-2.0'] | []                                       | ['base_model:mistralai/Mistral-Small-24B-Base-2501', 'base_model:quantized:mistralai/Mistral-Small-24B-Base-2501']                 |

hmmmmmmm, I need to clean my data import

#+header: :db (expand-file-name "hfmodelcards.sqlite" ob@huggingface_model_cards)
#+begin_src sqlite :results output table :var hfmcCsv="models_with_basemodel.csv"
select count(distinct arxiv_ids)  from model_cards
#+end_src


